
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)

	Для Каждого Строка Из Объект.СписокНоменклатуры Цикл
		РассчитатьСуммуСтроки(Строка);
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры


&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Цена = ПолучитьЦенуНоменклатурыНаСервере(ТекущиеДанные.Номенклатура);
	ТекущиеДанные.Цена = Цена;
	РассчитатьСуммуСтроки(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСтавкаНДСПриИзменении(Элемент)

	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСуммуСтрокиСНДС(ТекущиеДанные);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ДанныеСтроки)

	Скидка = Объект.Скидка / 100;
	ДанныеСтроки.Сумма = ДанныеСтроки.Цена * ДанныеСтроки.Количество * (1 - Скидка);
	РассчитатьСуммуСтрокиСНДС(ДанныеСтроки);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатурыНаСервере(Номенклатура)

	Цена = Номенклатура.Цена;
	Возврат Цена;

КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуСтрокиСНДС(ДанныеСтроки)

	Если Не ЗначениеЗаполнено(ДанныеСтроки.СтавкаНДС) Тогда
		ДанныеСтроки.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	КонецЕсли;

	СтавкаНДС = ДанныеСтроки.СтавкаНДС;

	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		ДанныеСтроки.СуммаСНДС = ДанныеСтроки.Сумма;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5") Тогда
		ДанныеСтроки.СуммаСНДС = ДанныеСтроки.Сумма * 1.05;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7") Тогда
		ДанныеСтроки.СуммаСНДС = ДанныеСтроки.Сумма * 1.07;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		ДанныеСтроки.СуммаСНДС = ДанныеСтроки.Сумма * 1.1;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22") Тогда
		ДанныеСтроки.СуммаСНДС = ДанныеСтроки.Сумма * 1.22;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти